-- 区間キロ程テーブル
USE
postgres;

INSERT INTO M_SectionKm (section_cd, start_station_cd, goal_station_cd, distance_km)
VALUES ('THK01', 'THK01', 'THK02', 3.6),   -- 東北新幹線各駅下り 東京ー上野
       ('THK02', 'THK02', 'CMN01', 26.7),  --上野ー大宮
       ('THK03', 'CMN01', 'THK03', 50.3),  --大宮ー小山
       ('THK04', 'THK03', 'THK04', 28.9),  --小山ー宇都宮
       ('THK05', 'THK04', 'THK05', 48.3),  --宇都宮ー那須高原
       ('THK06', 'THK05', 'THK06', 27.6),  --那須高原ー新白河
       ('THK07', 'THK06', 'THK07', 41.3),  --新白河ー郡山
       ('THK08', 'THK07', 'CMN02', 46.1),  --郡山ー福島
       ('THK09', 'CMN02', 'THK08', 34.0),  --福島ー白石蔵王
       ('THK10', 'THK08', 'THK09', 45.0),  --白石蔵王ー仙台
       ('THK11', 'THK09', 'THK10', 43.2),  --仙台ー古川
       ('THK12', 'THK10', 'THK11', 21.2),  --古川ーくりこま高原
       ('THK13', 'THK11', 'THK12', 28.9),  --くりこま高原ー一ノ関
       ('THK14', 'THK12', 'THK13', 25.0),  --一ノ関ー水沢江刺
       ('THK15', 'THK13', 'THK14', 17.4),  --水沢江刺ー北上
       ('THK16', 'THK14', 'THK15', 12.5),  --北上ー新花巻
       ('THK17', 'THK15', 'CMN03', 35.3),  --新花巻ー盛岡
       ('THK18', 'CMN03', 'THK16', 31.3),  --盛岡ーいわて沼宮内
       ('THK19', 'THK16', 'THK17', 34.6),  --いわて沼宮内ー二戸
       ('THK20', 'THK17', 'THK18', 30.9),  --二戸ー八戸
       ('THK21', 'THK18', 'THK19', 36.1),  --八戸ー七戸十和田
       ('THK22', 'THK19', 'THK20', 45.7),  --七戸十和田ー新青森
       ('THK24', 'THK01', 'CMN01', 30.3),  --東北新幹線はやぶさ急行下り 東京ー大宮
       ('THK25', 'CMN01', 'THK09', 321.5), --大宮ー仙台
       ('THK26', 'THK09', 'CMN03', 183.5), --仙台ー盛岡
       ('THK27', 'CMN03', 'THK18', 96.6),  --盛岡ー八戸
       ('THK28', 'THK18', 'THK20', 81.8),  --八戸ー新青森
       ('THK29', 'CMN03', 'THK20', 178.4), --盛岡ー新青森
       ('THK30', 'CMN01', 'THK04', 79.2),  --東北新幹線やまびこ急行下り 大宮ー宇都宮
       ('THK31', 'THK04', 'CMN02', 163.3), --宇都宮ー福島
       ('THK32', 'CMN02', 'THK09', 79.0),  --福島ー仙台
       ('THK33', 'THK04', 'THK07', 117.2), --宇都宮ー郡山
       ('YMG01', 'CMN02', 'YMG01', 40.1),  --山形新幹線各駅下り
       ('YMG02', 'YMG01', 'YMG02', 9.8),
       ('YMG03', 'YMG02', 'YMG03', 6.2),
       ('YMG04', 'YMG03', 'YMG04', 18.9),
       ('YMG05', 'YMG04', 'YMG05', 12.1),
       ('YMG06', 'YMG05', 'YMG06', 13.3),
       ('YMG07', 'YMG06', 'YMG07', 7.7),
       ('YMG08', 'YMG07', 'YMG08', 5.4),
       ('YMG09', 'YMG08', 'YMG09', 13.4),
       ('YMG10', 'YMG09', 'YMG10', 21.7),
       ('YMG11', 'YMG01', 'YMG05', 47.0),  --山形新幹線急行下り
       ('AKT01', 'CMN03', 'AKT01', 16.0),  --秋田新幹線各駅下り
       ('AKT02', 'AKT01', 'AKT02', 24.1),
       ('AKT03', 'AKT02', 'AKT03', 18.7),
       ('AKT04', 'AKT03', 'AKT04', 16.8),
       ('AKT05', 'AKT04', 'AKT05', 51.7),
       ('AKT06', 'CMN03', 'AKT04', 75.6),  --秋田新幹線急行下り
       ('AKT07', 'CMN03', 'AKT02', 40.1),
       ('JET01', 'CMN01', 'JET01', 34.4),  --上越新幹線各駅下り
       ('JET02', 'JET01', 'JET02', 21.3),
       ('JET03', 'JET02', 'CMN04', 19.0),
       ('JET04', 'CMN04', 'JET03', 46.6),
       ('JET05', 'JET03', 'JET04', 47.6),
       ('JET06', 'JET04', 'JET05', 1.8),
       ('JET07', 'JET04', 'JET06', 29.7),
       ('JET08', 'JET06', 'JET07', 41.7),
       ('JET09', 'JET07', 'JET08', 23.2),
       ('JET10', 'JET08', 'JET09', 40.1),
       ('JET11', 'CMN01', 'JET07', 240.3),--上越新幹線急行下り
       ('JET12', 'JET07', 'JET09', 63.3),
       ('JET13', 'CMN01', 'CMN04', 74.7),
       ('JET14', 'CMN04', 'JET04', 94.2),
       ('JET15', 'JET04', 'JET07', 71.4),
       ('JET16', 'JET01', 'CMN04', 40.3),
       ('HKR01', 'CMN04', 'HKR01', 18.5),  --北陸新幹線各駅下り
       ('HKR02', 'HKR01', 'HKR02', 23.3),
       ('HKR03', 'HKR02', 'HKR03', 17.6),
       ('HKR04', 'HKR03', 'HKR04', 24.8),
       ('HKR05', 'HKR04', 'HKR05', 33.2),
       ('HKR06', 'HKR05', 'HKR06', 29.9),
       ('HKR07', 'HKR06', 'HKR07', 29.6),
       ('HKR08', 'CMN01', 'HKR02', 116.5),--北陸新幹線急行下り
       ('HKR09', 'CMN01', 'HKR05', 192.1),
       ('HKR10', 'CMN04', 'HKR02', 41.8),
       ('HKR11', 'HKR05', 'HKR07', 59.5);
